unread.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-23 Sun 22:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reading List</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="./css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="./favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Reading List</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbb120bd">Unread Things</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbb120bd" class="outline-1">
<h1 id="orgbb120bd">Unread Things</h1>
<div class="outline-text-1" id="text-orgbb120bd">
<p>
<a href="https://applied-llms.org/">What we've learned from a year of building with LLMs</a>
</p>

<p>
<a href="https://yang-song.net/blog/2021/score/">Generative Modeling by Estimating Gradients of the Data Distribution</a>
</p>

<p>
<a href="https://markovbio.github.io/biomedical-progress/">A Future History of Biomedical Progress</a>
</p>

<p>
<a href="https://roberttlange.com/posts/2020/06/lottery-ticket-hypothesis/">the lottery ticket hypothesis: a survey</a>
</p>

<p>
<a href="https://x.com/stevenstrogatz/status/1794315234917937358">stupidity in scientific research</a>
</p>

<p>
<a href="https://github.com/naklecha/llama3-from-scratch">llama 3 from scratch</a> probably worth going through after chatgpt course
</p>

<p>
books
</p>

<p>
<a href="https://d2l.ai/">Dive into Deep Learning</a> code examples for things
</p>

<p>
<a href="https://www.bishopbook.com/">Deep Learning Foundations and Concepts</a> bishop book
</p>

<p>
Foundations of Computer Vision
</p>

<p>
Foundations of Applied Mathematics Volumes 1 + 2 (appropriate??)
</p>


<p>
lectures
</p>

<p>
<a href="https://www.youtube.com/watch?v=l8pRSuU81PU">let's reproduce gpt-2 (124M) Karpathy</a> interesting to compare with the course I'm taking, no need to do now
</p>

<p>
Papers
</p>

<p>
<a href="https://arxiv.org/abs/2310.01889">ring attention with blockwise transformers for near infinite context</a>
</p>

<p>
<a href="https://arxiv.org/abs/2402.17764">the era of 1-bit llms</a>
</p>

<p>
<a href="https://arxiv.org/abs/2403.09629">quiet-STaR: language models can teach themselves to think before speaking</a>
related: <a href="https://arxiv.org/pdf/2405.14838">From Explicit CoT to Implicit CoT: Learning to Internalize CoT Step by Step</a>
</p>

<p>
<a href="https://arxiv.org/abs/2404.07143">leave no context behind: efficient infinite context transformers with infini-attention</a>
</p>

<p>
<a href="https://arxiv.org/abs/2404.08819">the illusion of state in state-space models</a>
</p>

<p>
<a href="https://arxiv.org/abs/2404.15146">rethinking LLM memorization through the lens of adversarial compression</a>
</p>

<p>
<a href="https://arxiv.org/abs/2404.09562">σ-GPTs</a>
</p>

<p>
<a href="https://arxiv.org/abs/2404.19737">better and faster llms via multi-token prediction</a>
</p>

<p>
<a href="https://openreview.net/pdf?id=H1eerhIpLV">minigo: a case study in reproducing reinforcement learning research</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
